In [1]:
import pandas as pd
import numpy as np

In [2]:
s = pd.Series([1,3,5,6,8], index=list('abcde'))

In [3]:
s.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [4]:
s.reindex(list('abcdefg'))

a    1.0
b    3.0
c    5.0
d    6.0
e    8.0
f    NaN
g    NaN
dtype: float64

In [5]:
s.reindex(list('abcdefg'), method='ffill')
# 将数据填充为上一个数值,bfill向后填充，填充后面一个值

a    1
b    3
c    5
d    6
e    8
f    8
g    8
dtype: int64

In [6]:
df = pd.DataFrame(np.random.randn(4, 6), index=list('ABCD'), columns=['one', 'two', 'three', 'four', 'five', 'six'])# 二维数组的填充空白值
df

        one       two     three      four      five       six
A  0.071821  0.099286  0.535548 -3.036449  0.120340 -2.417862
B -0.004446  1.470576 -2.293578 -0.466938  1.775602  0.210239
C  1.101720 -0.583805 -0.714052  0.222069 -0.306590  0.988400
D -1.248326 -0.996326 -0.779269  1.204242  0.790958 -0.180923

In [7]:
df.reindex(index=list('ABCDEF'))

        one       two     three      four      five       six
A  0.071821  0.099286  0.535548 -3.036449  0.120340 -2.417862
B -0.004446  1.470576 -2.293578 -0.466938  1.775602  0.210239
C  1.101720 -0.583805 -0.714052  0.222069 -0.306590  0.988400
D -1.248326 -0.996326 -0.779269  1.204242  0.790958 -0.180923
E       NaN       NaN       NaN       NaN       NaN       NaN
F       NaN       NaN       NaN       NaN       NaN       NaN

In [8]:
df.reindex(index=list('ABCDEF'), fill_value=0)

        one       two     three      four      five       six
A  0.071821  0.099286  0.535548 -3.036449  0.120340 -2.417862
B -0.004446  1.470576 -2.293578 -0.466938  1.775602  0.210239
C  1.101720 -0.583805 -0.714052  0.222069 -0.306590  0.988400
D -1.248326 -0.996326 -0.779269  1.204242  0.790958 -0.180923
E  0.000000  0.000000  0.000000  0.000000  0.000000  0.000000
F  0.000000  0.000000  0.000000  0.000000  0.000000  0.000000

In [9]:
df.loc['A']['one'] = 100
df

          one       two     three      four      five       six
A  100.000000  0.099286  0.535548 -3.036449  0.120340 -2.417862
B   -0.004446  1.470576 -2.293578 -0.466938  1.775602  0.210239
C    1.101720 -0.583805 -0.714052  0.222069 -0.306590  0.988400
D   -1.248326 -0.996326 -0.779269  1.204242  0.790958 -0.180923

In [11]:
df

          one       two     three      four      five       six
A  100.000000  0.099286  0.535548 -3.036449  0.120340 -2.417862
B   -0.004446  1.470576 -2.293578 -0.466938  1.775602  0.210239
C    1.101720 -0.583805 -0.714052  0.222069 -0.306590  0.988400
D   -1.248326 -0.996326 -0.779269  1.204242  0.790958 -0.180923

In [13]:
df.drop('A')# 丢弃行，二维数组本身没有变化，只是拷贝的一份数据

        one       two     three      four      five       six
B -0.004446  1.470576 -2.293578 -0.466938  1.775602  0.210239
C  1.101720 -0.583805 -0.714052  0.222069 -0.306590  0.988400
D -1.248326 -0.996326 -0.779269  1.204242  0.790958 -0.180923

In [14]:
df.drop(['one'], axis=1)# 丢弃列

        two     three      four      five       six
A  0.099286  0.535548 -3.036449  0.120340 -2.417862
B  1.470576 -2.293578 -0.466938  1.775602  0.210239
C -0.583805 -0.714052  0.222069 -0.306590  0.988400
D -0.996326 -0.779269  1.204242  0.790958 -0.180923

In [15]:
#对二维数组中的值做函数处理,默认按列处理
df.apply(lambda x: x.max() - x.min())

one      101.248326
two        2.466901
three      2.829126
four       4.240691
five       2.082192
six        3.406261
dtype: float64

In [16]:
#对二维数组中的值做函数处理,按行处理
df.apply(lambda x: x.max() - x.min(), axis=1)

A    103.036449
B      4.069181
C      1.815772
D      2.452568
dtype: float64

In [17]:
df.apply?

In [19]:
def min_max(x):
    return pd.Series([x.min(), x.max()], index=['min', 'max'])
df.apply(min_max)

            one       two     three      four      five       six
min   -1.248326 -0.996326 -2.293578 -3.036449 -0.306590 -2.417862
max  100.000000  1.470576  0.535548  1.204242  1.775602  0.988400

In [20]:
df.apply(min_max, axis=1)

        min         max
A -3.036449  100.000000
B -2.293578    1.775602
C -0.714052    1.101720
D -1.248326    1.204242

In [21]:
df

          one       two     three      four      five       six
A  100.000000  0.099286  0.535548 -3.036449  0.120340 -2.417862
B   -0.004446  1.470576 -2.293578 -0.466938  1.775602  0.210239
C    1.101720 -0.583805 -0.714052  0.222069 -0.306590  0.988400
D   -1.248326 -0.996326 -0.779269  1.204242  0.790958 -0.180923

In [28]:
#formater = lambda x: '%.03f' % x # 保留3位小数
formater = '{0:.03f}'.format
df.applymap(formater)

       one     two   three    four    five     six
A  100.000   0.099   0.536  -3.036   0.120  -2.418
B   -0.004   1.471  -2.294  -0.467   1.776   0.210
C    1.102  -0.584  -0.714   0.222  -0.307   0.988
D   -1.248  -0.996  -0.779   1.204   0.791  -0.181

In [29]:
df.sort_values(by='one')

          one       two     three      four      five       six
D   -1.248326 -0.996326 -0.779269  1.204242  0.790958 -0.180923
B   -0.004446  1.470576 -2.293578 -0.466938  1.775602  0.210239
C    1.101720 -0.583805 -0.714052  0.222069 -0.306590  0.988400
A  100.000000  0.099286  0.535548 -3.036449  0.120340 -2.417862

In [30]:
df.sort_values(by='one', ascending=False)

          one       two     three      four      five       six
A  100.000000  0.099286  0.535548 -3.036449  0.120340 -2.417862
C    1.101720 -0.583805 -0.714052  0.222069 -0.306590  0.988400
B   -0.004446  1.470576 -2.293578 -0.466938  1.775602  0.210239
D   -1.248326 -0.996326 -0.779269  1.204242  0.790958 -0.180923

In [31]:
df.rank(method='first')

   one  two  three  four  five  six
A  4.0  3.0    4.0   1.0   2.0  1.0
B  2.0  4.0    1.0   2.0   4.0  3.0
C  3.0  2.0    3.0   3.0   1.0  4.0
D  1.0  1.0    2.0   4.0   3.0  2.0

In [32]:
s = pd.Series(list('abbbbcccdddd'))
s

0     a
1     b
2     b
3     b
4     b
5     c
6     c
7     c
8     d
9     d
10    d
11    d
dtype: object

In [34]:
s.value_counts()# 获取值的出现个数

d    4
b    4
c    3
a    1
dtype: int64

In [35]:
s.unique()#唯一的元素

array(['a', 'b', 'c', 'd'], dtype=object)